Revit 2027 API
PhaseFilter.GetPhaseStatusPresentation Method
 Gets the phase status presentation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PhaseStatusPresentation GetPhaseStatusPresentation(
	ElementOnPhaseStatus status
)
Public Function GetPhaseStatusPresentation (
	status As ElementOnPhaseStatus
) As PhaseStatusPresentation
public:
PhaseStatusPresentation GetPhaseStatusPresentation(
	ElementOnPhaseStatus status
)
member GetPhaseStatusPresentation :
        status : ElementOnPhaseStatus -> PhaseStatusPresentation
Parameters
status ElementOnPhaseStatus
 The element phase status.
Return Value
PhaseStatusPresentation
 The phase status presentation.
Exceptions
Exception | Condition
ArgumentException |  status is invalid for presentation query.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PhaseFilter Class
Autodesk.Revit.DB Namespace